Revit 2027 API
BuiltInFailures.RoomFailures.RoomBaseAboveComputationHeight Property
 [RoomBase]'s lower offset is above the Computation Height
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomBaseAboveComputationHeight { get; }
Public Shared ReadOnly Property RoomBaseAboveComputationHeight As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomBaseAboveComputationHeight {
	FailureDefinitionId^ get ();
}
static member RoomBaseAboveComputationHeight : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace